surah_ayah	position	string	meaning	ayah_link
2:23	8	ʿabdinā	Our slave	 وَإِنْ كُنْتُمْ فِي رَيْبٍ مِمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ
2:178	11	wal-ʿabdu	and the slave	 الْحُرُّ بِالْحُرِّ وَالْعَبْدُ
2:178	12	bil-ʿabdi	for the slave	 بِالْعَبْدِ وَالْأُنْثَىٰ بِالْأُنْثَىٰ
2:221	18	walaʿabdun	and a bondman	 وَلَعَبْدٌ مُؤْمِنٌ خَيْرٌ مِنْ مُشْرِكٍ وَلَوْ أَعْجَبَكُمْ
5:60	19	waʿabada	and (who) worshipped	 وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيرَ وَعَبَدَ الطَّاغُوتَ
8:41	23	ʿabdinā	Our slave	 إِنْ كُنْتُمْ آمَنْتُمْ بِاللَّهِ وَمَا أَنْزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ الْفُرْقَانِ
16:35	8	ʿabadnā	we (would) have worshipped	 وَقَالَ الَّذِينَ أَشْرَكُوا لَوْ شَاءَ اللَّهُ مَا عَبَدْنَا مِنْ دُونِهِ مِنْ شَيْءٍ
17:1	4	biʿabdihi	His servant	 سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا
18:1	6	ʿabdihi	His slave	 الْحَمْدُ لِلَّهِ الَّذِي أَنْزَلَ عَلَىٰ عَبْدِهِ الْكِتَابَ وَلَمْ يَجْعَلْ لَهُ عِوَجًا
19:2	4	ʿabdahu	(to) His servant	 ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهُ زَكَرِيَّا
19:30	3	ʿabdu	a slave	 قَالَ إِنِّي عَبْدُ اللَّهِ آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا
25:1	6	ʿabdihi	His slave	 تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَىٰ عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا
26:22	6	ʿabbadtta	you have enslaved	 وَتِلْكَ نِعْمَةٌ تَمُنُّهَا عَلَيَّ أَنْ عَبَّدْتَ بَنِي إِسْرَائِيلَ
34:9	28	ʿabdin	slave	 إِنَّ فِي ذَٰلِكَ لَآيَةً لِكُلِّ عَبْدٍ مُنِيبٍ
38:17	6	ʿabdanā	Our slave	 اصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاذْكُرْ عَبْدَنَا دَاوُودَ ذَا الْأَيْدِ
38:30	5	l-ʿabdu	slave	 وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ
38:41	2	ʿabdanā	Our slave	 وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ
38:44	12	l-ʿabdu	slave	 إِنَّا وَجَدْنَاهُ صَابِرًا نِعْمَ الْعَبْدُ إِنَّهُ أَوَّابٌ
39:36	4	ʿabdahu	(for) His slave	 أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ
43:20	6	ʿabadnāhum	we would not have worshipped them	 وَقَالُوا لَوْ شَاءَ الرَّحْمَٰنُ مَا عَبَدْنَاهُمْ
43:59	4	ʿabdun	a slave	 إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنَا عَلَيْهِ وَجَعَلْنَاهُ مَثَلًا لِبَنِي إِسْرَائِيلَ
50:8	4	ʿabdin	slave	 تَبْصِرَةً وَذِكْرَىٰ لِكُلِّ عَبْدٍ مُنِيبٍ
53:10	3	ʿabdihi	His slave	 فَأَوْحَىٰ إِلَىٰ عَبْدِهِ مَا أَوْحَىٰ
54:9	6	ʿabdanā	Our slave	 كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ
57:9	5	ʿabdihi	His slave	 هُوَ الَّذِي يُنَزِّلُ عَلَىٰ عَبْدِهِ آيَاتٍ بَيِّنَاتٍ
72:19	4	ʿabdu	(the) slave	 وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ كَادُوا يَكُونُونَ عَلَيْهِ لِبَدًا
109:4	5	ʿabadttum	you worship	 وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ
1:5	2	naʿbudu	we worship	 إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ
2:21	3	uʿ'budū	worship	 يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِنْ قَبْلِكُمْ
2:83	7	taʿbudūna	you will worship	 وَإِذْ أَخَذْنَا مِيثَاقَ بَنِي إِسْرَائِيلَ لَا تَعْبُدُونَ إِلَّا اللَّهَ
2:90	20	ʿibādihi	His servants	 أَنْ يُنَزِّلَ اللَّهُ مِنْ فَضْلِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ
2:133	12	taʿbudūna	will you worship	 إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِنْ بَعْدِي
2:133	16	naʿbudu	We will worship	 قَالُوا نَعْبُدُ إِلَٰهَكَ وَإِلَٰهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ
2:138	10	ʿābidūna	(are) worshippers	 وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً وَنَحْنُ لَهُ عَابِدُونَ
2:172	14	taʿbudūna	worship Him	 وَاشْكُرُوا لِلَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ
2:186	3	ʿibādī	My servants	 وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ
2:207	11	bil-ʿibādi	to His servants	 وَاللَّهُ رَءُوفٌ بِالْعِبَادِ
3:15	24	bil-ʿibādi	of (His) slaves	 وَأَزْوَاجٌ مُطَهَّرَةٌ وَرِضْوَانٌ مِنَ اللَّهِ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ
3:20	26	bil-ʿibādi	of [His] slaves	 وَإِنْ تَوَلَّوْا فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَاللَّهُ بَصِيرٌ بِالْعِبَادِ
3:30	26	bil-ʿibādi	to (His) [the] slaves	 وَيُحَذِّرُكُمُ اللَّهُ نَفْسَهُ وَاللَّهُ رَءُوفٌ بِالْعِبَادِ
3:51	5	fa-uʿ'budūhu	so worship Him	 إِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ
3:64	11	naʿbuda	we worship	 تَعَالَوْا إِلَىٰ كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ
3:79	14	ʿibādan	worshippers	 ثُمَّ يَقُولَ لِلنَّاسِ كُونُوا عِبَادًا لِي مِنْ دُونِ اللَّهِ
3:182	9	lil'ʿabīdi	to (His) slaves	 ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ
4:36	1	wa-uʿ'budū	And worship	 وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا
4:118	6	ʿibādika	your slaves	 وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَفْرُوضًا
4:172	6	ʿabdan	a slave	 لَنْ يَسْتَنْكِفَ الْمَسِيحُ أَنْ يَكُونَ عَبْدًا لِلَّهِ
4:172	14	ʿibādatihi	His worship	 وَمَنْ يَسْتَنْكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا
5:72	15	uʿ'budū	Worship	 وَقَالَ الْمَسِيحُ يَا بَنِي إِسْرَائِيلَ اعْبُدُوا اللَّهَ رَبِّي وَرَبَّكُمْ
5:76	2	ataʿbudūna	Do you worship	 قُلْ أَتَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَمْلِكُ لَكُمْ ضَرًّا وَلَا نَفْعًا
5:117	9	uʿ'budū	You worship	 مَا قُلْتُ لَهُمْ إِلَّا مَا أَمَرْتَنِي بِهِ أَنِ اعْبُدُوا اللَّهَ رَبِّي وَرَبَّكُمْ
5:118	4	ʿibāduka	(are) Your slaves	 إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ
6:18	4	ʿibādihi	His slaves	 وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ وَهُوَ الْحَكِيمُ الْخَبِيرُ
6:56	5	aʿbuda	I worship	 قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ
6:61	4	ʿibādihi	His slaves	 وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِ وَيُرْسِلُ عَلَيْكُمْ حَفَظَةً
6:88	9	ʿibādihi	His slaves	 ذَٰلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ
6:102	11	fa-uʿ'budūhu	so worship Him	 ذَٰلِكُمُ اللَّهُ رَبُّكُمْ لَا إِلَٰهَ إِلَّا هُوَ خَالِقُ كُلِّ شَيْءٍ فَاعْبُدُوهُ
7:32	8	liʿibādihi	for His slaves	 قُلْ مَنْ حَرَّمَ زِينَةَ اللَّهِ الَّتِي أَخْرَجَ لِعِبَادِهِ وَالطَّيِّبَاتِ مِنَ الرِّزْقِ
7:59	8	uʿ'budū	Worship	 فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ
7:65	7	uʿ'budū	Worship	 وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
7:70	3	linaʿbuda	that we (should) worship	 قَالُوا أَجِئْتَنَا لِنَعْبُدَ اللَّهَ وَحْدَهُ
7:70	9	yaʿbudu	worship	 قَالُوا أَجِئْتَنَا لِنَعْبُدَ اللَّهَ وَحْدَهُ وَنَذَرَ مَا كَانَ يَعْبُدُ آبَاؤُنَا
7:73	7	uʿ'budū	Worship	 وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
7:85	7	uʿ'budū	Worship	 وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
7:128	14	ʿibādihi	His servants	 إِنَّ الْأَرْضَ لِلَّهِ يُورِثُهَا مَنْ يَشَاءُ مِنْ عِبَادِهِ
7:194	7	ʿibādun	(are) slaves	 إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ عِبَادٌ أَمْثَالُكُمْ
7:206	8	ʿibādatihi	His worship	 إِنَّ الَّذِينَ عِنْدَ رَبِّكَ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ
8:51	9	lil'ʿabīdi	to His slaves	 ذَٰلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ
9:31	14	liyaʿbudū	that they worship	 وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا إِلَٰهًا وَاحِدًا
9:104	9	ʿibādihi	His slaves	 أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ
9:112	2	l-ʿābidūna	those who worship	 التَّائِبُونَ الْعَابِدُونَ الْحَامِدُونَ السَّائِحُونَ
10:3	27	fa-uʿ'budūhu	so worship Him	 ذَٰلِكُمُ اللَّهُ رَبُّكُمْ فَاعْبُدُوهُ أَفَلَا تَذَكَّرُونَ
10:18	1	wayaʿbudūna	And they worship	 وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَضُرُّهُمْ وَلَا يَنْفَعُهُمْ
10:28	18	taʿbudūna	worship us	 فَزَيَّلْنَا بَيْنَهُمْ وَقَالَ شُرَكَاؤُهُمْ مَا كُنْتُمْ إِيَّانَا تَعْبُدُونَ
10:29	9	ʿibādatikum	your worship	 إِنْ كُنَّا عَنْ عِبَادَتِكُمْ لَغَافِلِينَ
10:104	11	aʿbudu	I worship	 إِنْ كُنْتُمْ فِي شَكٍّ مِنْ دِينِي فَلَا أَعْبُدُ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ
10:104	13	taʿbudūna	you worship	 إِنْ كُنْتُمْ فِي شَكٍّ مِنْ دِينِي فَلَا أَعْبُدُ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ
10:104	18	aʿbudu	I worship	 وَلَٰكِنْ أَعْبُدُ اللَّهَ الَّذِي يَتَوَفَّاكُمْ
10:107	21	ʿibādihi	His slaves	 يُصِيبُ بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ وَهُوَ الْغَفُورُ الرَّحِيمُ
11:2	2	taʿbudū	you worship	 أَلَّا تَعْبُدُوا إِلَّا اللَّهَ إِنَّنِي لَكُمْ مِنْهُ نَذِيرٌ وَبَشِيرٌ
11:26	3	taʿbudū	worship	 أَنْ لَا تَعْبُدُوا إِلَّا اللَّهَ إِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ أَلِيمٍ
11:50	7	uʿ'budū	Worship	 وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
11:61	7	uʿ'budū	Worship	 وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
11:62	11	naʿbuda	we worship	 أَتَنْهَانَا أَنْ نَعْبُدَ مَا يَعْبُدُ آبَاؤُنَا
11:62	13	yaʿbudu	our forefathers worshipped	 أَتَنْهَانَا أَنْ نَعْبُدَ مَا يَعْبُدُ آبَاؤُنَا
11:84	7	uʿ'budū	Worship	 وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا قَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
11:87	8	yaʿbudu	worship	 أَصَلَاتُكَ تَأْمُرُكَ أَنْ نَتْرُكَ مَا يَعْبُدُ آبَاؤُنَا
11:109	6	yaʿbudu	worship	 فَلَا تَكُ فِي مِرْيَةٍ مِمَّا يَعْبُدُ هَٰؤُلَاءِ
11:109	9	yaʿbudūna	they worship	 مَا يَعْبُدُونَ إِلَّا كَمَا يَعْبُدُ آبَاؤُهُمْ مِنْ قَبْلُ
11:109	12	yaʿbudu	worshipped	 مَا يَعْبُدُونَ إِلَّا كَمَا يَعْبُدُ آبَاؤُهُمْ مِنْ قَبْلُ
11:123	9	fa-uʿ'bud'hu	so worship Him	 وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ
12:24	18	ʿibādinā	Our slaves	 عَنْهُ السُّوءَ وَالْفَحْشَاءَ إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ
12:40	2	taʿbudūna	you worship	 مَا تَعْبُدُونَ مِنْ دُونِهِ إِلَّا أَسْمَاءً سَمَّيْتُمُوهَا أَنْتُمْ وَآبَاؤُكُمْ
12:40	22	taʿbudū	you worship	 إِنِ الْحُكْمُ إِلَّا لِلَّهِ أَمَرَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ
13:36	17	aʿbuda	I worship	 قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ
14:10	29	yaʿbudu	worship	 تُرِيدُونَ أَنْ تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا
14:11	16	ʿibādihi	His slaves	 وَلَٰكِنَّ اللَّهَ يَمُنُّ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ
14:31	2	liʿibādiya	to My slaves	 قُلْ لِعِبَادِيَ الَّذِينَ آمَنُوا يُقِيمُوا الصَّلَاةَ
14:35	12	naʿbuda	we worship	 رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ
15:40	2	ʿibādaka	Your slaves	 إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ
15:42	2	ʿibādī	My slaves	 إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ
15:49	2	ʿibādī	My slaves	 نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ
15:99	1	wa-uʿ'bud	And worship	 وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ
16:2	10	ʿibādihi	His slaves	 يُنَزِّلُ الْمَلَائِكَةَ بِالرُّوحِ مِنْ أَمْرِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ
16:36	8	uʿ'budū	Worship	 وَلَقَدْ بَعَثْنَا فِي كُلِّ أُمَّةٍ رَسُولًا أَنِ اعْبُدُوا اللَّهَ
16:73	1	wayaʿbudūna	And they worship	 وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَمْلِكُ لَهُمْ رِزْقًا
16:75	4	ʿabdan	(of) a slave	 ضَرَبَ اللَّهُ مَثَلًا عَبْدًا مَمْلُوكًا لَا يَقْدِرُ عَلَىٰ شَيْءٍ
16:114	13	taʿbudūna	you worship	 وَاشْكُرُوا نِعْمَتَ اللَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ
17:3	8	ʿabdan	a servant	 ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍ إِنَّهُ كَانَ عَبْدًا شَكُورًا
17:5	7	ʿibādan	servants	 فَإِذَا جَاءَ وَعْدُ أُولَاهُمَا بَعَثْنَا عَلَيْكُمْ عِبَادًا لَنَا أُولِي بَأْسٍ شَدِيدٍ
17:17	11	ʿibādihi	(of) His servants	 وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِ خَبِيرًا بَصِيرًا
17:23	4	taʿbudū	worship	 وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا
17:30	10	biʿibādihi	of His slaves	 إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا
17:53	2	liʿibādī	to My slaves	 وَقُلْ لِعِبَادِي يَقُولُوا الَّتِي هِيَ أَحْسَنُ
17:65	2	ʿibādī	My slaves	 إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ وَكَفَىٰ بِرَبِّكَ وَكِيلًا
17:96	9	biʿibādihi	of His slaves	 قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا
18:16	4	yaʿbudūna	they worship	 وَإِذِ اعْتَزَلْتُمُوهُمْ وَمَا يَعْبُدُونَ إِلَّا اللَّهَ فَأْوُوا إِلَى الْكَهْفِ
18:65	2	ʿabdan	a servant	 فَوَجَدَا عَبْدًا مِنْ عِبَادِنَا آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا
18:65	4	ʿibādinā	Our servants	 فَوَجَدَا عَبْدًا مِنْ عِبَادِنَا آتَيْنَاهُ رَحْمَةً مِنْ عِنْدِنَا
18:102	6	ʿibādī	My servants	 أَفَحَسِبَ الَّذِينَ كَفَرُوا أَنْ يَتَّخِذُوا عِبَادِي مِنْ دُونِي أَوْلِيَاءَ
18:110	22	biʿibādati	in (the) worship	 فَلْيَعْمَلْ عَمَلًا صَالِحًا وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا
19:36	5	fa-uʿ'budūhu	so worship Him	 وَإِنَّ اللَّهَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ
19:42	6	taʿbudu	(do) you worship	 إِذْ قَالَ لِأَبِيهِ يَا أَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ
19:44	3	taʿbudi	worship	 يَا أَبَتِ لَا تَعْبُدِ الشَّيْطَانَ إِنَّ الشَّيْطَانَ كَانَ لِلرَّحْمَٰنِ عَصِيًّا
19:49	4	yaʿbudūna	they worshipped	 فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُونَ مِنْ دُونِ اللَّهِ وَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ
19:61	6	ʿibādahu	(to) His slaves	 جَنَّاتِ عَدْنٍ الَّتِي وَعَدَ الرَّحْمَٰنُ عِبَادَهُ بِالْغَيْبِ
19:63	6	ʿibādinā	Our slaves	 تِلْكَ الْجَنَّةُ الَّتِي نُورِثُ مِنْ عِبَادِنَا مَنْ كَانَ تَقِيًّا
19:65	6	fa-uʿ'bud'hu	so worship Him	 رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهِ
19:65	8	liʿibādatihi	in His worship	 فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهِ
19:82	3	biʿibādatihim	their worship (of them)	 كَلَّا سَيَكْفُرُونَ بِعِبَادَتِهِمْ وَيَكُونُونَ عَلَيْهِمْ ضِدًّا
19:93	10	ʿabdan	(as) a slave	 إِنْ كُلُّ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ إِلَّا آتِي الرَّحْمَٰنِ عَبْدًا
20:14	8	fa-uʿ'bud'nī	so worship Me	 إِنَّنِي أَنَا اللَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي
20:77	7	biʿibādī	with My slaves	 وَلَقَدْ أَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَسْرِ بِعِبَادِي
21:19	11	ʿibādatihi	worship Him	 وَمَنْ عِنْدَهُ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلَا يَسْتَحْسِرُونَ
21:25	15	fa-uʿ'budūni	so worship Me	 وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ إِلَّا نُوحِي إِلَيْهِ أَنَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاعْبُدُونِ
21:26	7	ʿibādun	(they are) slaves	 وَقَالُوا اتَّخَذَ الرَّحْمَٰنُ وَلَدًا سُبْحَانَهُ بَلْ عِبَادٌ مُكْرَمُونَ
21:53	5	ʿābidīna	worshippers	 قَالُوا وَجَدْنَا آبَاءَنَا لَهَا عَابِدِينَ
21:66	2	afataʿbudūna	Then do you worship	 قَالَ أَفَتَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُكُمْ شَيْئًا وَلَا يَضُرُّكُمْ
21:67	4	taʿbudūna	you worship	 أُفٍّ لَكُمْ وَلِمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ أَفَلَا تَعْقِلُونَ
21:73	15	ʿābidīna	worshippers	 وَكَانُوا لَنَا عَابِدِينَ
21:84	16	lil'ʿābidīna	for the worshippers	 وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُمْ مَعَهُمْ رَحْمَةً مِنْ عِنْدِنَا وَذِكْرَىٰ لِلْعَابِدِينَ
21:92	8	fa-uʿ'budūni	so worship Me	 إِنَّ هَٰذِهِ أُمَّتُكُمْ أُمَّةً وَاحِدَةً وَأَنَا رَبُّكُمْ فَاعْبُدُونِ
21:98	3	taʿbudūna	you worship	 إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنْتُمْ لَهَا وَارِدُونَ
21:105	11	ʿibādiya	My slaves	 وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِنْ بَعْدِ الذِّكْرِ أَنَّ الْأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ
21:106	6	ʿābidīna	worshippers	 إِنَّ فِي هَٰذَا لَبَلَاغًا لِقَوْمٍ عَابِدِينَ
22:10	9	lil'ʿabīdi	to His slaves	 ذَٰلِكَ بِمَا قَدَّمَتْ يَدَاكَ وَأَنَّ اللَّهَ لَيْسَ بِظَلَّامٍ لِلْعَبِيدِ
22:11	4	yaʿbudu	worships	 وَمِنَ النَّاسِ مَنْ يَعْبُدُ اللَّهَ عَلَىٰ حَرْفٍ
22:71	1	wayaʿbudūna	And they worship	 وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَمْ يُنَزِّلْ بِهِ سُلْطَانًا
22:77	6	wa-uʿ'budū	and worship	 يَا أَيُّهَا الَّذِينَ آمَنُوا ارْكَعُوا وَاسْجُدُوا وَاعْبُدُوا رَبَّكُمْ
23:23	8	uʿ'budū	Worship	 وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
23:32	6	uʿ'budū	Worship	 فَأَرْسَلْنَا فِيهِمْ رَسُولًا مِنْهُمْ أَنِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَٰهٍ غَيْرُهُ
23:47	7	ʿābidūna	(are) slaves	 فَقَالُوا أَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا وَقَوْمُهُمَا لَنَا عَابِدُونَ
23:109	5	ʿibādī	My slaves	 إِنَّهُ كَانَ فَرِيقٌ مِنْ عِبَادِي يَقُولُونَ رَبَّنَا آمَنَّا
24:32	6	ʿibādikum	your male slaves	 وَأَنْكِحُوا الْأَيَامَىٰ مِنْكُمْ وَالصَّالِحِينَ مِنْ عِبَادِكُمْ وَإِمَائِكُمْ
24:55	27	yaʿbudūnanī	(for) they worship Me	 يَعْبُدُونَنِي لَا يُشْرِكُونَ بِي شَيْئًا
25:17	4	yaʿbudūna	they worship	 وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ مِنْ دُونِ اللَّهِ
25:17	11	ʿibādī	My slaves	 فَيَقُولُ أَأَنْتُمْ أَضْلَلْتُمْ عِبَادِي هَٰؤُلَاءِ أَمْ هُمْ ضَلُّوا السَّبِيلَ
25:55	1	wayaʿbudūna	But they worship	 وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُهُمْ وَلَا يَضُرُّهُمْ
25:58	12	ʿibādihi	(of) His slaves	 وَكَفَىٰ بِهِ بِذُنُوبِ عِبَادِهِ خَبِيرًا
25:63	1	waʿibādu	And (the) slaves	 وَعِبَادُ الرَّحْمَٰنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا
26:52	6	biʿibādī	with My slaves	 وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ أَسْرِ بِعِبَادِي إِنَّكُمْ مُتَّبَعُونَ
26:70	6	taʿbudūna	(do) you worship	 إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَا تَعْبُدُونَ
26:71	2	naʿbudu	We worship	 قَالُوا نَعْبُدُ أَصْنَامًا فَنَظَلُّ لَهَا عَاكِفِينَ
26:75	5	taʿbudūna	worshipping	 قَالَ أَفَرَأَيْتُمْ مَا كُنْتُمْ تَعْبُدُونَ
26:92	6	taʿbudūna	(to) worship	 وَقِيلَ لَهُمْ أَيْنَ مَا كُنْتُمْ تَعْبُدُونَ
27:15	14	ʿibādihi	His servants	 وَقَالَا الْحَمْدُ لِلَّهِ الَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٍ مِنْ عِبَادِهِ الْمُؤْمِنِينَ
27:19	23	ʿibādika	Your slaves	 وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ
27:43	4	taʿbudu	worship	 وَصَدَّهَا مَا كَانَتْ تَعْبُدُ مِنْ دُونِ اللَّهِ إِنَّهَا كَانَتْ مِنْ قَوْمٍ كَافِرِينَ
27:45	8	uʿ'budū	Worship	 وَلَقَدْ أَرْسَلْنَا إِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا أَنِ اعْبُدُوا اللَّهَ
27:59	6	ʿibādihi	His slaves	 قُلِ الْحَمْدُ لِلَّهِ وَسَلَامٌ عَلَىٰ عِبَادِهِ الَّذِينَ اصْطَفَىٰ
27:91	4	aʿbuda	I worship	 إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا
28:63	18	yaʿbudūna	worship us	 تَبَرَّأْنَا إِلَيْكَ مَا كَانُوا إِيَّانَا يَعْبُدُونَ
28:82	14	ʿibādihi	His slaves	 وَيْكَأَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ
29:16	5	uʿ'budū	Worship	 وَإِبْرَاهِيمَ إِذْ قَالَ لِقَوْمِهِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ
29:17	2	taʿbudūna	you worship	 إِنَّمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ أَوْثَانًا وَتَخْلُقُونَ إِفْكًا
29:17	11	taʿbudūna	you worship	 إِنَّ الَّذِينَ تَعْبُدُونَ مِنْ دُونِ اللَّهِ لَا يَمْلِكُونَ لَكُمْ رِزْقًا
29:17	23	wa-uʿ'budūhu	and worship Him	 فَابْتَغُوا عِنْدَ اللَّهِ الرِّزْقَ وَاعْبُدُوهُ وَاشْكُرُوا لَهُ
29:36	7	uʿ'budū	Worship	 وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ
29:56	1	yāʿibādiya	O My servants	 يَا عِبَادِيَ الَّذِينَ آمَنُوا إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ
29:56	8	fa-uʿ'budūni	worship Me	 إِنَّ أَرْضِي وَاسِعَةٌ فَإِيَّايَ فَاعْبُدُونِ
29:62	7	ʿibādihi	His slaves	 اللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ
30:48	25	ʿibādihi	His slaves	 فَإِذَا أَصَابَ بِهِ مَنْ يَشَاءُ مِنْ عِبَادِهِ إِذَا هُمْ يَسْتَبْشِرُونَ
34:13	18	ʿibādiya	My slaves	 اعْمَلُوا آلَ دَاوُودَ شُكْرًا وَقَلِيلٌ مِنْ عِبَادِيَ الشَّكُورُ
34:39	9	ʿibādihi	His slaves	 قُلْ إِنَّ رَبِّي يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ
34:40	10	yaʿbudūna	worshipping	 ثُمَّ يَقُولُ لِلْمَلَائِكَةِ أَهَٰؤُلَاءِ إِيَّاكُمْ كَانُوا يَعْبُدُونَ
34:41	9	yaʿbudūna	(to) worship	 قَالُوا سُبْحَانَكَ أَنْتَ وَلِيُّنَا مِنْ دُونِهِمْ بَلْ كَانُوا يَعْبُدُونَ الْجِنَّ
34:43	16	yaʿbudu	(to) worship	 مَا هَٰذَا إِلَّا رَجُلٌ يُرِيدُ أَنْ يَصُدَّكُمْ عَمَّا كَانَ يَعْبُدُ آبَاؤُكُمْ
35:28	12	ʿibādihi	His slaves	 إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ
35:31	14	biʿibādihi	of His slaves	 إِنَّ اللَّهَ بِعِبَادِهِ لَخَبِيرٌ بَصِيرٌ
35:32	7	ʿibādinā	Our slaves	 ثُمَّ أَوْرَثْنَا الْكِتَابَ الَّذِينَ اصْطَفَيْنَا مِنْ عِبَادِنَا
35:45	24	biʿibādihi	of His slaves	 فَإِذَا جَاءَ أَجَلُهُمْ فَإِنَّ اللَّهَ كَانَ بِعِبَادِهِ بَصِيرًا
36:22	4	aʿbudu	I worship	 وَمَا لِيَ لَا أَعْبُدُ الَّذِي فَطَرَنِي وَإِلَيْهِ تُرْجَعُونَ
36:30	3	l-ʿibādi	the servants	 يَا حَسْرَةً عَلَى الْعِبَادِ مَا يَأْتِيهِمْ مِنْ رَسُولٍ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ
36:60	8	taʿbudū	worship	 أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي آدَمَ أَنْ لَا تَعْبُدُوا الشَّيْطَانَ
36:61	2	uʿ'budūnī	you worship Me	 وَأَنِ اعْبُدُونِي
37:22	7	yaʿbudūna	worship	 احْشُرُوا الَّذِينَ ظَلَمُوا وَأَزْوَاجَهُمْ وَمَا كَانُوا يَعْبُدُونَ
37:40	2	ʿibāda	(the) slaves	 إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ
37:74	2	ʿibāda	(the) slaves	 إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ
37:81	3	ʿibādinā	Our slaves	 إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ
37:85	6	taʿbudūna	you worship	 إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِ مَاذَا تَعْبُدُونَ
37:95	2	ataʿbudūna	Do you worship	 قَالَ أَتَعْبُدُونَ مَا تَنْحِتُونَ
37:111	3	ʿibādinā	Our slaves	 إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ
37:122	3	ʿibādinā	Our slaves	 إِنَّهُمَا مِنْ عِبَادِنَا الْمُؤْمِنِينَ
37:128	2	ʿibāda	(the) slaves	 إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ
37:132	3	ʿibādinā	Our slaves	 إِنَّهُ مِنْ عِبَادِنَا الْمُؤْمِنِينَ
37:160	2	ʿibāda	(the) slaves	 إِلَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ
37:161	3	taʿbudūna	you worship	 فَإِنَّكُمْ وَمَا تَعْبُدُونَ
37:169	2	ʿibāda	slaves	 لَكُنَّا عِبَادَ اللَّهِ الْمُخْلَصِينَ
37:171	4	liʿibādinā	for Our slaves	 وَلَقَدْ سَبَقَتْ كَلِمَتُنَا لِعِبَادِنَا الْمُرْسَلِينَ
38:45	2	ʿibādanā	Our slaves	 وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ
38:83	2	ʿibādaka	Your slaves	 إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ
39:2	6	fa-uʿ'budi	so worship	 إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ فَاعْبُدِ اللَّهَ مُخْلِصًا لَهُ الدِّينَ
39:3	11	naʿbuduhum	we worship them	 مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَىٰ
39:7	9	liʿibādihi	in His slaves	 إِنْ تَكْفُرُوا فَإِنَّ اللَّهَ غَنِيٌّ عَنْكُمْ وَلَا يَرْضَىٰ لِعِبَادِهِ الْكُفْرَ
39:10	2	yāʿibādi	O My slaves	 قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ
39:11	5	aʿbuda	I worship	 قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَهُ الدِّينَ
39:14	3	aʿbudu	I worship Allah	 قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَهُ دِينِي
39:15	1	fa-uʿ'budū	So worship	 فَاعْبُدُوا مَا شِئْتُمْ مِنْ دُونِهِ
39:16	14	ʿibādahu	His slaves	 ذَٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ يَا عِبَادِ فَاتَّقُونِ
39:16	15	yāʿibādi	O My slaves	 ذَٰلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ يَا عِبَادِ فَاتَّقُونِ
39:17	5	yaʿbudūhā	they worship them	 وَالَّذِينَ اجْتَنَبُوا الطَّاغُوتَ أَنْ يَعْبُدُوهَا
39:17	12	ʿibādi	(to) My slaves	 وَأَنَابُوا إِلَى اللَّهِ لَهُمُ الْبُشْرَىٰ فَبَشِّرْ عِبَادِ
39:46	12	ʿibādika	Your slaves	 أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِي مَا كَانُوا فِيهِ يَخْتَلِفُونَ
39:53	2	yāʿibādiya	O My slaves	 قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ
39:64	5	aʿbudu	(to) worship	 قُلْ أَفَغَيْرَ اللَّهِ تَأْمُرُونِّي أَعْبُدُ أَيُّهَا الْجَاهِلُونَ
39:66	3	fa-uʿ'bud	But worship Allah	 بَلِ اللَّهَ فَاعْبُدْ وَكُنْ مِنَ الشَّاكِرِينَ
40:15	13	ʿibādihi	His slaves	 يُلْقِي الرُّوحَ مِنْ أَمْرِهِ عَلَىٰ مَنْ يَشَاءُ مِنْ عِبَادِهِ
40:31	14	lil'ʿibādi	for (His) slaves	 وَمَا اللَّهُ يُرِيدُ ظُلْمًا لِلْعِبَادِ
40:44	12	bil-ʿibādi	of (His) slaves	 وَأُفَوِّضُ أَمْرِي إِلَى اللَّهِ إِنَّ اللَّهَ بَصِيرٌ بِالْعِبَادِ
40:48	12	l-ʿibādi	(His) slaves	 قَالَ الَّذِينَ اسْتَكْبَرُوا إِنَّا كُلٌّ فِيهَا إِنَّ اللَّهَ قَدْ حَكَمَ بَيْنَ الْعِبَادِ
40:60	10	ʿibādatī	worship Me	 إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ
40:66	5	aʿbuda	worship	 قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ
40:85	14	ʿibādihi	His slaves	 سُنَّتَ اللَّهِ الَّتِي قَدْ خَلَتْ فِي عِبَادِهِ وَخَسِرَ هُنَالِكَ الْكَافِرُونَ
41:14	10	taʿbudū	worship	 إِذْ جَاءَتْهُمُ الرُّسُلُ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ
41:37	19	taʿbudūna	worship	 وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ
41:46	11	lil'ʿabīdi	to His slaves	 وَمَنْ أَسَاءَ فَعَلَيْهَا وَمَا رَبُّكَ بِظَلَّامٍ لِلْعَبِيدِ
42:19	3	biʿibādihi	with His slaves	 اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَنْ يَشَاءُ وَهُوَ الْقَوِيُّ الْعَزِيزُ
42:23	5	ʿibādahu	(to) His slaves 	 ذَٰلِكَ الَّذِي يُبَشِّرُ اللَّهُ عِبَادَهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ
42:25	6	ʿibādihi	His slaves	 وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَعْفُو عَنِ السَّيِّئَاتِ
42:27	5	liʿibādihi	for His slaves	 وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ
42:27	15	biʿibādihi	of His slaves	 وَلَٰكِنْ يُنَزِّلُ بِقَدَرٍ مَا يَشَاءُ إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ
42:52	22	ʿibādinā	Our slaves	 وَلَٰكِنْ جَعَلْنَاهُ نُورًا نَهْدِي بِهِ مَنْ نَشَاءُ مِنْ عِبَادِنَا
43:15	4	ʿibādihi	His slaves	 وَجَعَلُوا لَهُ مِنْ عِبَادِهِ جُزْءًا إِنَّ الْإِنْسَانَ لَكَفُورٌ مُبِينٌ
43:19	5	ʿibādu	(are) slaves	 وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَٰنِ إِنَاثًا
43:26	9	taʿbudūna	you worship	 وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ وَقَوْمِهِ إِنَّنِي بَرَاءٌ مِمَّا تَعْبُدُونَ
43:45	13	yuʿ'badūna	to be worshipped	 أَجَعَلْنَا مِنْ دُونِ الرَّحْمَٰنِ آلِهَةً يُعْبَدُونَ
43:64	6	fa-uʿ'budūhu	so worship Him	 إِنَّ اللَّهَ هُوَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ هَٰذَا صِرَاطٌ مُسْتَقِيمٌ
43:68	1	yāʿibādi	O My slaves	 يَا عِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَا أَنْتُمْ تَحْزَنُونَ
43:81	8	l-ʿābidīna	(of) the worshippers	 قُلْ إِنْ كَانَ لِلرَّحْمَٰنِ وَلَدٌ فَأَنَا أَوَّلُ الْعَابِدِينَ
44:18	4	ʿibāda	(the) servants	 أَنْ أَدُّوا إِلَيَّ عِبَادَ اللَّهِ إِنِّي لَكُمْ رَسُولٌ أَمِينٌ
44:23	2	biʿibādī	with My slaves	 فَأَسْرِ بِعِبَادِي لَيْلًا إِنَّكُمْ مُتَّبَعُونَ
46:6	8	biʿibādatihim	of their worship	 وَكَانُوا بِعِبَادَتِهِمْ كَافِرِينَ
46:21	17	taʿbudū	you worship	 وَقَدْ خَلَتِ النُّذُرُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ
50:11	2	lil'ʿibādi	for the slaves	 رِزْقًا لِلْعِبَادِ
50:29	8	lil'ʿabīdi	to My slaves	 مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ
51:56	6	liyaʿbudūni	that they worship Me	 وَمَا خَلَقْتُ الْجِنَّ وَالْإِنْسَ إِلَّا لِيَعْبُدُونِ
53:62	3	wa-uʿ'budū	and worship (Him)	 فَاسْجُدُوا لِلَّهِ وَاعْبُدُوا
60:4	17	taʿbudūna	you worship	 إِذْ قَالُوا لِقَوْمِهِمْ إِنَّا بُرَآءُ مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ اللَّهِ
66:5	14	ʿābidātin	who worship	 مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ
66:10	12	ʿabdayni	two [slaves]	 كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا
66:10	14	ʿibādinā	Our slaves	 كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا
71:3	2	uʿ'budū	Worship	 أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ
71:27	5	ʿibādaka	Your slaves	 إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا
76:6	4	ʿibādu	(the) slaves	 عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا
89:29	3	ʿibādī	My slaves	 فَادْخُلِي فِي عِبَادِي
96:10	1	ʿabdan	A slave	 عَبْدًا إِذَا صَلَّىٰ
98:5	4	liyaʿbudū	to worship	 وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ
106:3	1	falyaʿbudū	So let them worship	 فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ
109:2	2	aʿbudu	I worship	 لَا أَعْبُدُ مَا تَعْبُدُونَ
109:2	4	taʿbudūna	you worship	 لَا أَعْبُدُ مَا تَعْبُدُونَ
109:3	3	ʿābidūna	(are) worshippers	 وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ
109:3	5	aʿbudu	I worship	 وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ
109:4	3	ʿābidun	a worshipper	 وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ
109:5	3	ʿābidūna	(are) worshippers	 وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ
109:5	5	aʿbudu	I worship	 وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ
